<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD

help(package="MASS")

help(mean)
?mean

help(cars)
?cars

help(quine, package="MASS")

## ----------------------------------------------------------------

installed.packages()
installed.packages()[, 1]

install.packages("ggplot2")
library(ggplot2)

if(!require(ggplot2)) install.packages('ggplot2')
installed.packages()[, 1]

## ----------------------------------------------------------------
(a<-3)
(.a<-4)
(A<-5)


## ----------------------------------------------------------------
# 1.a<-6 # error


## ----------------------------------------------------------------
a<-3; b<-4
a+b


## ----------------------------------------------------------------
x<-10; y <-5; z<-3;
x+y
x-y
x*y + z
x/y
y^2
y%/%z # 몫
y%% z # 나머지


## ----------------------------------------------------------------
(c<-"Hello")


## ----------------------------------------------------------------
c1<-"South Africa"
nchar(c1)


## ----------------------------------------------------------------
substr(c1,1,5)
substr(c1,7,12)


## ----------------------------------------------------------------
(x<-NA)
is.na(x)


## ----------------------------------------------------------------
10/0


## ----------------------------------------------------------------
0/0
Inf-Inf
is.nan(0/0)
is.nan(3) # 비교 


## ----------------------------------------------------------------
v1<-c(1,2,NA)
v2<-c("a", "b", "c")
v3<-c("d", "e")
v4<-c(v2,v3)
(v5<-c(1,2,"a")) # 숫자 원소들을 문자로 형식 자동 변환


## ----------------------------------------------------------------
c(v2, v3, c("apple", "pie"))


## ----------------------------------------------------------------
10:15
4:-2
seq(from = 1, to = 10, by = 2)
seq(from=1, to=2, length.out=5)
rep(1, times = 5)
rep(c(1,2), times = 2)


## ----------------------------------------------------------------
v<-c(3, pi, 4)
v[3] # 3번째 원소 선택


## ----------------------------------------------------------------
v<-c(3, pi, 4)
names(v)<-c("num1", "num2", "num3")
v["num1"]


## ----------------------------------------------------------------
v[-1] # 1번째 원소 제외
v[2:3] # 2, 3번째 원소 선택
v[c(1,3)] # 1, 3 번째 원소 선택
v[c("num1", "num3")]


## ----------------------------------------------------------------
v<-c(3, pi, 4)
w<-c(pi, pi, pi)

v == w


## ----------------------------------------------------------------
v[v==w]
v[v<=w]


## ----------------------------------------------------------------
any(v==pi)
all(v==pi)


## ----------------------------------------------------------------
new.v<-c(v, NA)
is.na(new.v)


## ----------------------------------------------------------------
new.v[!is.na(new.v)]  


## ----------------------------------------------------------------
length(w)
NROW(w)


## ----------------------------------------------------------------
nrow(w)


## ----------------------------------------------------------------
LETTERS
length(LETTERS)
LETTERS[1:3]


## ----------------------------------------------------------------
paste("Today is", date())

paste("1st", "2nd", "3rd", sep = ", ")

paste("1st", "2nd", "3rd", sep = "")


## ----------------------------------------------------------------
(blood.v<-rep(c("O", "AB", "A"), length.out=10))
(blood.f1<-factor(blood.v))
table(blood.f1)
(blood.f2<-factor(blood.v, levels=c("A", "B", "AB", "O")))
table(blood.f2)
(blood.f3<-factor(blood.f2)) #벡터에서 사용되지 않는 값은 레벨에서 삭제함  


## ----------------------------------------------------------------
fac1<-factor(LETTERS[1:5])
fac2<-factor(LETTERS[1:5], levels=c("C", "D", "E", "B", "A"))
table(fac1)
table(fac2)


## ----------------------------------------------------------------
fac3<-factor(1:3, labels=c("A", "B", "C"))
table(fac3)


## ----------------------------------------------------------------
matrix(1:12, nrow = 3)
matrix(1:12, nrow = 3, byrow=TRUE)


## ----------------------------------------------------------------
x<-matrix(1:12, ncol = 3)
nrow(x)
ncol(x)
dim(x)


## ----------------------------------------------------------------
v1<-1:4
v2<-5:8
cbind(v1,v2) # column bind
rbind(v1,v2) # row bind


## ----------------------------------------------------------------
x<-matrix(1:8, ncol = 4)
x[1,2]
x[2,3]
x[, 1:2]
x[, c(1,4)]
x[-1,]


## ----------------------------------------------------------------
rownames(x)<-c("r1", "r2")
x
colnames(x)<-c("c1", "c2", "c3", "c4")
x
x["r1",]
x[, c("c1", "c3")]


## ----------------------------------------------------------------
x <- c(100, 75, 80)
y <- c("10452", "10455", "10565")
z <- data.frame(score=x, ID=y)
z


## ----------------------------------------------------------------
z$score
z$ID


## ----------------------------------------------------------------
z$name<-c("Mike", "Tony", "Evan")
z


## ----------------------------------------------------------------
colnames(z)


## ----------------------------------------------------------------
str(z)


## ----------------------------------------------------------------
z[1,2]
z[1,]
z[, c("name", "ID")]


## ----------------------------------------------------------------
library(MASS) # 내장된 MASS library를 loading
head(Cars93, n=3)


## ----------------------------------------------------------------
str(Cars93)


## ----------------------------------------------------------------
Hong <- list(kor.name="길동", eng.name="Gil-dong", age=40, married=T, no.child=2, child.ages=c(3, 7))
Hong


## ----------------------------------------------------------------
Hong$age
Hong$kor.name
Hong$child.ages

Hong[[3]] # 두 겹 괄호로 리스트의 부분 추출 가능
Hong[c(1,2)] # 여러 개를 추출할 때는 한겹 괄호



## ----------------------------------------------------------------
is.list(Hong)

class(MASS::Cars93)
x<-matrix(1:9, ncol = 3)
class(x)
x
newx<-as.data.frame(x)
class(newx)
is.matrix(newx)


## ----------------------------------------------------------------
is.data.frame(newx)
names(newx)
newx$V1


## ----------------------------------------------------------------
data1<-read.table(file="D:/Dropbox/StatCourses/R_bigdata_202108/DataSet/KOSPI.csv", 
                  header=T, sep=",")


## ----------------------------------------------------------------
colnames(data1)
dim(data1)
str(data1)
head(data1, n=3)
tail(data1, n=3)


## ----------------------------------------------------------------
data1$newDate<-as.Date(data1$Date)
str(data1)


## ----------------------------------------------------------------
data1$Date[10] - data1$Date[1]
data1$newDate[10] - data1$newDate[1]

data1$newDate[10]
data1$newDate[1]
data1$newDate[1]+11


## ----------------------------------------------------------------
strDates <- c("01/05/2010", "08/16/1995")
as.Date(strDates) # 제대로 인식 못함 
as.Date(strDates, "%m/%d/%Y") # 형식 적용 



## ----------------------------------------------------------------
(today <- Sys.Date())
format(today, "%B %d %Y")
format(Sys.Date(), "%a %b %d")


## ----------------------------------------------------------------
getwd()


## ----------------------------------------------------------------
setwd("D:/Dropbox/StatCourses/R_bigdata_202108/")
getwd()

data1new<-read.table(file="DataSet/KOSPI.csv", header=T, sep=",")

colnames(data1new)


## ----------------------------------------------------------------
data2<-read.csv(file="DataSet/KOSPI.csv") 
all(data1new==data2) 


## ----------------------------------------------------------------
tab_dat<-read.table("DataSet/hsb2.txt", header=T, sep="\t")
tab_dat[1:3, ]


## ----------------------------------------------------------------
if (!require('readxl')) install.packages('readxl') 
library('readxl')

data5<-read_excel("DataSet/excel_exam.xlsx") 


## ----------------------------------------------------------------
data6<-read_excel("DataSet/excel_exam_sheet.xlsx", sheet=3) 


## ----------------------------------------------------------------
save(data1, tab_dat, file="Output/newR.Rdata")


## ----------------------------------------------------------------
load(file="Output/newR.Rdata")


## ----------------------------------------------------------------
write.csv(data1, file="Output/data1_1.csv", row.names=T)
write.csv(data1, file="Output/data1_2.csv", row.names=F)

write.table(data1, file="Output/data1_3.txt")


## ----------------------------------------------------------------
subset(Cars93, select=c(Model, MPG.city, AirBags), subset=(MPG.city>30))
sub<-subset(Cars93, select=c(Model, MPG.city, AirBags), subset=(MPG.city>30 & AirBags !="None"))
sub
subset(sub, select=-AirBags)


## ----------------------------------------------------------------
attach(MASS::Cars93)
table(Type, DriveTrain)



## ----------------------------------------------------------------
detach(MASS::Cars93)


## ----------------------------------------------------------------
library(MASS)
table(Cars93$Type, Cars93$DriveTrain)
with(Cars93, table(Type, DriveTrain))


## ----------------------------------------------------------------
table(Cars93$AirBags)
Cars93[Cars93$AirBags == "Driver & Passenger", 1:2]


## ----------------------------------------------------------------
(idx<-which(Cars93$AirBags == "Driver & Passenger"))
Cars93[idx, 1:2]


## ----------------------------------------------------------------
for(i in 1:3){
  print(paste("i=", i))
}


## ----------------------------------------------------------------
for(i in 1:5){
  if(i %% 2 == 0){
    print('짝수')
  }
  else{
    print('홀수')
  }
}


## ----------------------------------------------------------------
w1<-1:5
ifelse(w1 %% 2 == 0, "짝수", "홀수")


## ----------------------------------------------------------------
x <- list(a = 1:10, beta = exp(-3:3))
(y<-lapply(x, mean))
(z<-sapply(x, mean))
y$a
z[1]


## ----------------------------------------------------------------
(mat <- cbind(x1 = 3, x2 = c(3:1, 2:4)))
rownames(mat)<-letters[1:6]
apply(mat, 1, mean)
apply(mat, 2, mean)


## ----------------------------------------------------------------
tapply(Cars93$Price, Cars93$Type, mean)
#with(Cars93, tapply(Price, Type, mean))


## ----------------------------------------------------------------
aggregate(Price ~ Type, Cars93, mean)


## ----------------------------------------------------------------
## ----------------------------------------------------------------

library(dplyr)

## ----------------------------------------------------------------
exam<-read.csv("DataSet/csv_exam.csv")

exam %>% filter(class == 1)


## ----------------------------------------------------------------
exam %>% filter(class %in% c(1,3))


## ----------------------------------------------------------------
exam %>% filter(math >= 90 | english >= 90)


## ----------------------------------------------------------------
exam %>% filter(class == 2 & english >= 80)
# exam %>% filter(class == 2, english >= 80) 


## ----------------------------------------------------------------
class1<-exam %>% filter(class == 1)
mean(class1$english)


## ----------------------------------------------------------------
df <- data.frame(sex = c("M", "F", NA, "M", "F"),
                 score = c(5, 4, 3, 4, NA))
df

is.na(df)               # 결측치 확인
table(is.na(df))        # 결측치 빈도 출력
table(is.na(df$sex))  # sex 결측치 빈도 출력


## ----------------------------------------------------------------
df[is.na(df$sex), ]

df %>% filter(is.na(sex))


## ----------------------------------------------------------------
df[!is.na(df$sex), ]

df %>% filter(!is.na(sex))


## ----------------------------------------------------------------
df[!is.na(df$sex)&!is.na(df$score), ]

df %>% filter(!is.na(sex)&!is.na(score))


## ----------------------------------------------------------------
na.omit(df)


## ----------------------------------------------------------------
mean(c(1,2,3, NA))
mean(c(1,2,3, NA), na.rm=T)


## ----------------------------------------------------------------
select<- dplyr::select
exam %>% select(class, math, english) %>% head(3)


## ----------------------------------------------------------------
exam %>% select(classroom=class, math, english) %>% head(3)


## ----------------------------------------------------------------
exam %>% rename(classroom=class) %>% head(3)


## ----------------------------------------------------------------
exam %>% select(-math) %>% head(5)


## ----------------------------------------------------------------
exam %>% select(-math, -english) %>% head(5)


## ----------------------------------------------------------------
exam %>% select(-(math:science)) %>% head(5)


## ----------------------------------------------------------------
exam %>% arrange(math)


## ----------------------------------------------------------------
exam %>% arrange(desc(math)) %>% head(10)


## ----------------------------------------------------------------
exam %>% arrange(english, math) %>% head(10)


## ----------------------------------------------------------------
exam %>% top_n(5, math)


## ----------------------------------------------------------------
exam %>% arrange(desc(math)) %>% head(5)


## ----------------------------------------------------------------
exam %>%
  mutate(average = (math + english + science)/3) %>%
  head


## ----------------------------------------------------------------
exam %>%
  mutate(average = (math + english + science)/3) %>%
  arrange(average) %>%
  head


## ----------------------------------------------------------------
head(exam, n=10)

new_exam<-exam %>% mutate(test=ifelse(science >=70, "pass", "fail"))

head(new_exam, n=10)


## ----------------------------------------------------------------
exam %>% summarise(mean_sc = mean(science))


## ----------------------------------------------------------------
exam %>% summarise(mean_math = mean(math),
            sum_math = sum(math),
            median_math = median(math),
            n = n())


## ----------------------------------------------------------------
exam %>% summarise(class=n_distinct(class))
table(exam$class)


## ----------------------------------------------------------------
exam %>% group_by(class) %>%
  summarise(mean_sc = mean(science))


## ----------------------------------------------------------------
exam %>% group_by(class) %>%
  summarise(mean_math = mean(math),
            median_math = median(math),
            n = n())


## ----------------------------------------------------------------
exam %>% sample_n(7)


## ----------------------------------------------------------------
exam %>% sample_frac(0.2)


## ----------------------------------------------------------------
library(nycflights13)


## ----eval=F------------------------------------------------------
## ?flights # 도움말


## ----------------------------------------------------------------
str(flights)


## ----------------------------------------------------------------
flights %>% filter(month == 1, day == 1) %>% head(5)


## ----------------------------------------------------------------
df <- flights %>% filter(month == 1 & day %in% c(3, 4))
nrow(df)

flights %>% filter(month == 1 & day %in% c(3, 4)) %>%  summarize(n=n())


## ----------------------------------------------------------------
arrange(flights, year, month, day) %>% head(5)


## ----------------------------------------------------------------
arrange(flights, desc(dep_delay)) %>% head(5)


## ----------------------------------------------------------------
flights  %>%  select(year, month, day) %>% head(3)

flights %>% select(year:day) %>% head(3)


## ----------------------------------------------------------------
select(flights, -(year:day)) %>% head(3)


## ----------------------------------------------------------------
flights %>%  select(tail_num = tailnum) %>% head(5)


## ----------------------------------------------------------------
flights %>%  rename(tail_num = tailnum) %>% head(5)


## ----------------------------------------------------------------
flights %>% mutate(gain = arr_delay - dep_delay, speed = distance * 60 / air_time) %>%  head(3)


## ----------------------------------------------------------------
f1<-mutate(flights, gain = arr_delay - dep_delay, speed = distance * 60 / air_time)
colnames(f1)


## ----------------------------------------------------------------
flights %>%  summarise(delay = mean(dep_delay, na.rm = TRUE))

#summarise(flights, delay = mean(dep_delay)) # NA


## ----------------------------------------------------------------
flights %>%
  group_by(year, month, day) %>%
  select(arr_delay, dep_delay, year, month, day) %>%
  summarise(arr = mean(arr_delay, na.rm = TRUE), dep = mean(dep_delay, na.rm = TRUE)) %>%
  filter(arr > 50 & dep > 50)


## ----------------------------------------------------------------
name<-data.frame(class = c(1, 2, 3, 4, 5),
                   teacher = c("kim", "lee", "park", "choi", "jung"))
name

exam_new<-left_join(exam, name, by = "class")
head(exam_new, n=10)


## ----------------------------------------------------------------
group_a <- data.frame(id = c(1, 2, 3, 4, 5), test = c(60, 80, 70, 90, 85))

group_b <- data.frame(id = c(5, 7, 8), test = c(65, 80, 90))

group_all <- bind_rows(group_a, group_b)
group_all


## ----------------------------------------------------------------
bind_rows(data.frame(x = 1:3), data.frame(y = 1:4))


## ----------------------------------------------------------------
payroll<-read.csv("DataSet/payroll.csv")
head(payroll, n=7)


## ----------------------------------------------------------------
payroll2<-read.csv("DataSet/payroll2.csv")
head(payroll2, n=7)


## ----------------------------------------------------------------
payroll$BirthD<-as.Date(as.character(payroll$Birth), '%Y/%m/%d')
payroll$BirthD[1:5]
str(payroll)


## ----------------------------------------------------------------
min_b<-payroll %>% group_by(Gender) %>% summarize(BirthD = min(BirthD))
min_b


## ----------------------------------------------------------------
left_join(min_b, payroll, by="BirthD")


## ----------------------------------------------------------------
payroll$Age<-floor((Sys.Date()-payroll$BirthD)/ 365.25)
payroll %>% group_by(Jobcode) %>% summarize(avg_age = round(mean(Age), digits=0), avg_salary = mean(Salary))


## ----------------------------------------------------------------
names(payroll2)[1]<-names(payroll)[1]
updated<-left_join(payroll, payroll2, by="IdNumber")
updated$salary2<-ifelse(is.na(updated$salary), updated$Salary, updated$salary)
updated %>% select(IdNumber, Gender, Jobcode, Salary, salary, salary2) %>% head(15)

=======

help(package="MASS")

help(mean)
?mean

help(cars)
?cars

help(quine, package="MASS")

## ----------------------------------------------------------------

installed.packages()
installed.packages()[, 1]

install.packages("ggplot2")
library(ggplot2)

if(!require(ggplot2)) install.packages('ggplot2')
installed.packages()[, 1]

## ----------------------------------------------------------------
(a<-3)
(.a<-4)
(A<-5)


## ----------------------------------------------------------------
# 1.a<-6 # error


## ----------------------------------------------------------------
a<-3; b<-4
a+b


## ----------------------------------------------------------------
x<-10; y <-5; z<-3;
x+y
x-y
x*y + z
x/y
y^2
y%/%z # 몫
y%% z # 나머지


## ----------------------------------------------------------------
(c<-"Hello")


## ----------------------------------------------------------------
c1<-"South Africa"
nchar(c1)


## ----------------------------------------------------------------
substr(c1,1,5)
substr(c1,7,12)


## ----------------------------------------------------------------
(x<-NA)
is.na(x)


## ----------------------------------------------------------------
10/0


## ----------------------------------------------------------------
0/0
Inf-Inf
is.nan(0/0)
is.nan(3) # 비교 


## ----------------------------------------------------------------
v1<-c(1,2,NA)
v2<-c("a", "b", "c")
v3<-c("d", "e")
v4<-c(v2,v3)
(v5<-c(1,2,"a")) # 숫자 원소들을 문자로 형식 자동 변환


## ----------------------------------------------------------------
c(v2, v3, c("apple", "pie"))


## ----------------------------------------------------------------
10:15
4:-2
seq(from = 1, to = 10, by = 2)
seq(from=1, to=2, length.out=5)
rep(1, times = 5)
rep(c(1,2), times = 2)


## ----------------------------------------------------------------
v<-c(3, pi, 4)
v[3] # 3번째 원소 선택


## ----------------------------------------------------------------
v<-c(3, pi, 4)
names(v)<-c("num1", "num2", "num3")
v["num1"]


## ----------------------------------------------------------------
v[-1] # 1번째 원소 제외
v[2:3] # 2, 3번째 원소 선택
v[c(1,3)] # 1, 3 번째 원소 선택
v[c("num1", "num3")]


## ----------------------------------------------------------------
v<-c(3, pi, 4)
w<-c(pi, pi, pi)

v == w


## ----------------------------------------------------------------
v[v==w]
v[v<=w]


## ----------------------------------------------------------------
any(v==pi)
all(v==pi)


## ----------------------------------------------------------------
new.v<-c(v, NA)
is.na(new.v)


## ----------------------------------------------------------------
new.v[!is.na(new.v)]  


## ----------------------------------------------------------------
length(w)
NROW(w)


## ----------------------------------------------------------------
nrow(w)


## ----------------------------------------------------------------
LETTERS
length(LETTERS)
LETTERS[1:3]


## ----------------------------------------------------------------
paste("Today is", date())

paste("1st", "2nd", "3rd", sep = ", ")

paste("1st", "2nd", "3rd", sep = "")


## ----------------------------------------------------------------
(blood.v<-rep(c("O", "AB", "A"), length.out=10))
(blood.f1<-factor(blood.v))
table(blood.f1)
(blood.f2<-factor(blood.v, levels=c("A", "B", "AB", "O")))
table(blood.f2)
(blood.f3<-factor(blood.f2)) #벡터에서 사용되지 않는 값은 레벨에서 삭제함  


## ----------------------------------------------------------------
fac1<-factor(LETTERS[1:5])
fac2<-factor(LETTERS[1:5], levels=c("C", "D", "E", "B", "A"))
table(fac1)
table(fac2)


## ----------------------------------------------------------------
fac3<-factor(1:3, labels=c("A", "B", "C"))
table(fac3)


## ----------------------------------------------------------------
matrix(1:12, nrow = 3)
matrix(1:12, nrow = 3, byrow=TRUE)


## ----------------------------------------------------------------
x<-matrix(1:12, ncol = 3)
nrow(x)
ncol(x)
dim(x)


## ----------------------------------------------------------------
v1<-1:4
v2<-5:8
cbind(v1,v2) # column bind
rbind(v1,v2) # row bind


## ----------------------------------------------------------------
x<-matrix(1:8, ncol = 4)
x[1,2]
x[2,3]
x[, 1:2]
x[, c(1,4)]
x[-1,]


## ----------------------------------------------------------------
rownames(x)<-c("r1", "r2")
x
colnames(x)<-c("c1", "c2", "c3", "c4")
x
x["r1",]
x[, c("c1", "c3")]


## ----------------------------------------------------------------
x <- c(100, 75, 80)
y <- c("10452", "10455", "10565")
z <- data.frame(score=x, ID=y)
z


## ----------------------------------------------------------------
z$score
z$ID


## ----------------------------------------------------------------
z$name<-c("Mike", "Tony", "Evan")
z


## ----------------------------------------------------------------
colnames(z)


## ----------------------------------------------------------------
str(z)


## ----------------------------------------------------------------
z[1,2]
z[1,]
z[, c("name", "ID")]


## ----------------------------------------------------------------
library(MASS) # 내장된 MASS library를 loading
head(Cars93, n=3)


## ----------------------------------------------------------------
str(Cars93)


## ----------------------------------------------------------------
Hong <- list(kor.name="길동", eng.name="Gil-dong", age=40, married=T, no.child=2, child.ages=c(3, 7))
Hong


## ----------------------------------------------------------------
Hong$age
Hong$kor.name
Hong$child.ages

Hong[[3]] # 두 겹 괄호로 리스트의 부분 추출 가능
Hong[c(1,2)] # 여러 개를 추출할 때는 한겹 괄호



## ----------------------------------------------------------------
is.list(Hong)

class(MASS::Cars93)
x<-matrix(1:9, ncol = 3)
class(x)
x
newx<-as.data.frame(x)
class(newx)
is.matrix(newx)


## ----------------------------------------------------------------
is.data.frame(newx)
names(newx)
newx$V1


## ----------------------------------------------------------------
data1<-read.table(file="D:/Dropbox/StatCourses/R_bigdata_202108/DataSet/KOSPI.csv", 
                  header=T, sep=",")


## ----------------------------------------------------------------
colnames(data1)
dim(data1)
str(data1)
head(data1, n=3)
tail(data1, n=3)


## ----------------------------------------------------------------
data1$newDate<-as.Date(data1$Date)
str(data1)


## ----------------------------------------------------------------
data1$Date[10] - data1$Date[1]
data1$newDate[10] - data1$newDate[1]

data1$newDate[10]
data1$newDate[1]
data1$newDate[1]+11


## ----------------------------------------------------------------
strDates <- c("01/05/2010", "08/16/1995")
as.Date(strDates) # 제대로 인식 못함 
as.Date(strDates, "%m/%d/%Y") # 형식 적용 



## ----------------------------------------------------------------
(today <- Sys.Date())
format(today, "%B %d %Y")
format(Sys.Date(), "%a %b %d")


## ----------------------------------------------------------------
getwd()


## ----------------------------------------------------------------
setwd("D:/Dropbox/StatCourses/R_bigdata_202108/")
getwd()

data1new<-read.table(file="DataSet/KOSPI.csv", header=T, sep=",")

colnames(data1new)


## ----------------------------------------------------------------
data2<-read.csv(file="DataSet/KOSPI.csv") 
all(data1new==data2) 


## ----------------------------------------------------------------
tab_dat<-read.table("DataSet/hsb2.txt", header=T, sep="\t")
tab_dat[1:3, ]


## ----------------------------------------------------------------
if (!require('readxl')) install.packages('readxl') 
library('readxl')

data5<-read_excel("DataSet/excel_exam.xlsx") 


## ----------------------------------------------------------------
data6<-read_excel("DataSet/excel_exam_sheet.xlsx", sheet=3) 


## ----------------------------------------------------------------
save(data1, tab_dat, file="Output/newR.Rdata")


## ----------------------------------------------------------------
load(file="Output/newR.Rdata")


## ----------------------------------------------------------------
write.csv(data1, file="Output/data1_1.csv", row.names=T)
write.csv(data1, file="Output/data1_2.csv", row.names=F)

write.table(data1, file="Output/data1_3.txt")


## ----------------------------------------------------------------
subset(Cars93, select=c(Model, MPG.city, AirBags), subset=(MPG.city>30))
sub<-subset(Cars93, select=c(Model, MPG.city, AirBags), subset=(MPG.city>30 & AirBags !="None"))
sub
subset(sub, select=-AirBags)


## ----------------------------------------------------------------
attach(MASS::Cars93)
table(Type, DriveTrain)



## ----------------------------------------------------------------
detach(MASS::Cars93)


## ----------------------------------------------------------------
library(MASS)
table(Cars93$Type, Cars93$DriveTrain)
with(Cars93, table(Type, DriveTrain))


## ----------------------------------------------------------------
table(Cars93$AirBags)
Cars93[Cars93$AirBags == "Driver & Passenger", 1:2]


## ----------------------------------------------------------------
(idx<-which(Cars93$AirBags == "Driver & Passenger"))
Cars93[idx, 1:2]


## ----------------------------------------------------------------
for(i in 1:3){
  print(paste("i=", i))
}


## ----------------------------------------------------------------
for(i in 1:5){
  if(i %% 2 == 0){
    print('짝수')
  }
  else{
    print('홀수')
  }
}


## ----------------------------------------------------------------
w1<-1:5
ifelse(w1 %% 2 == 0, "짝수", "홀수")


## ----------------------------------------------------------------
x <- list(a = 1:10, beta = exp(-3:3))
(y<-lapply(x, mean))
(z<-sapply(x, mean))
y$a
z[1]


## ----------------------------------------------------------------
(mat <- cbind(x1 = 3, x2 = c(3:1, 2:4)))
rownames(mat)<-letters[1:6]
apply(mat, 1, mean)
apply(mat, 2, mean)


## ----------------------------------------------------------------
tapply(Cars93$Price, Cars93$Type, mean)
#with(Cars93, tapply(Price, Type, mean))


## ----------------------------------------------------------------
aggregate(Price ~ Type, Cars93, mean)


## ----------------------------------------------------------------
## ----------------------------------------------------------------

library(dplyr)

## ----------------------------------------------------------------
exam<-read.csv("DataSet/csv_exam.csv")

exam %>% filter(class == 1)


## ----------------------------------------------------------------
exam %>% filter(class %in% c(1,3))


## ----------------------------------------------------------------
exam %>% filter(math >= 90 | english >= 90)


## ----------------------------------------------------------------
exam %>% filter(class == 2 & english >= 80)
# exam %>% filter(class == 2, english >= 80) 


## ----------------------------------------------------------------
class1<-exam %>% filter(class == 1)
mean(class1$english)


## ----------------------------------------------------------------
df <- data.frame(sex = c("M", "F", NA, "M", "F"),
                 score = c(5, 4, 3, 4, NA))
df

is.na(df)               # 결측치 확인
table(is.na(df))        # 결측치 빈도 출력
table(is.na(df$sex))  # sex 결측치 빈도 출력


## ----------------------------------------------------------------
df[is.na(df$sex), ]

df %>% filter(is.na(sex))


## ----------------------------------------------------------------
df[!is.na(df$sex), ]

df %>% filter(!is.na(sex))


## ----------------------------------------------------------------
df[!is.na(df$sex)&!is.na(df$score), ]

df %>% filter(!is.na(sex)&!is.na(score))


## ----------------------------------------------------------------
na.omit(df)


## ----------------------------------------------------------------
mean(c(1,2,3, NA))
mean(c(1,2,3, NA), na.rm=T)


## ----------------------------------------------------------------
select<- dplyr::select
exam %>% select(class, math, english) %>% head(3)


## ----------------------------------------------------------------
exam %>% select(classroom=class, math, english) %>% head(3)


## ----------------------------------------------------------------
exam %>% rename(classroom=class) %>% head(3)


## ----------------------------------------------------------------
exam %>% select(-math) %>% head(5)


## ----------------------------------------------------------------
exam %>% select(-math, -english) %>% head(5)


## ----------------------------------------------------------------
exam %>% select(-(math:science)) %>% head(5)


## ----------------------------------------------------------------
exam %>% arrange(math)


## ----------------------------------------------------------------
exam %>% arrange(desc(math)) %>% head(10)


## ----------------------------------------------------------------
exam %>% arrange(english, math) %>% head(10)


## ----------------------------------------------------------------
exam %>% top_n(5, math)


## ----------------------------------------------------------------
exam %>% arrange(desc(math)) %>% head(5)


## ----------------------------------------------------------------
exam %>%
  mutate(average = (math + english + science)/3) %>%
  head


## ----------------------------------------------------------------
exam %>%
  mutate(average = (math + english + science)/3) %>%
  arrange(average) %>%
  head


## ----------------------------------------------------------------
head(exam, n=10)

new_exam<-exam %>% mutate(test=ifelse(science >=70, "pass", "fail"))

head(new_exam, n=10)


## ----------------------------------------------------------------
exam %>% summarise(mean_sc = mean(science))


## ----------------------------------------------------------------
exam %>% summarise(mean_math = mean(math),
            sum_math = sum(math),
            median_math = median(math),
            n = n())


## ----------------------------------------------------------------
exam %>% summarise(class=n_distinct(class))
table(exam$class)


## ----------------------------------------------------------------
exam %>% group_by(class) %>%
  summarise(mean_sc = mean(science))


## ----------------------------------------------------------------
exam %>% group_by(class) %>%
  summarise(mean_math = mean(math),
            median_math = median(math),
            n = n())


## ----------------------------------------------------------------
exam %>% sample_n(7)


## ----------------------------------------------------------------
exam %>% sample_frac(0.2)


## ----------------------------------------------------------------
library(nycflights13)


## ----eval=F------------------------------------------------------
## ?flights # 도움말


## ----------------------------------------------------------------
str(flights)


## ----------------------------------------------------------------
flights %>% filter(month == 1, day == 1) %>% head(5)


## ----------------------------------------------------------------
df <- flights %>% filter(month == 1 & day %in% c(3, 4))
nrow(df)

flights %>% filter(month == 1 & day %in% c(3, 4)) %>%  summarize(n=n())


## ----------------------------------------------------------------
arrange(flights, year, month, day) %>% head(5)


## ----------------------------------------------------------------
arrange(flights, desc(dep_delay)) %>% head(5)


## ----------------------------------------------------------------
flights  %>%  select(year, month, day) %>% head(3)

flights %>% select(year:day) %>% head(3)


## ----------------------------------------------------------------
select(flights, -(year:day)) %>% head(3)


## ----------------------------------------------------------------
flights %>%  select(tail_num = tailnum) %>% head(5)


## ----------------------------------------------------------------
flights %>%  rename(tail_num = tailnum) %>% head(5)


## ----------------------------------------------------------------
flights %>% mutate(gain = arr_delay - dep_delay, speed = distance * 60 / air_time) %>%  head(3)


## ----------------------------------------------------------------
f1<-mutate(flights, gain = arr_delay - dep_delay, speed = distance * 60 / air_time)
colnames(f1)


## ----------------------------------------------------------------
flights %>%  summarise(delay = mean(dep_delay, na.rm = TRUE))

#summarise(flights, delay = mean(dep_delay)) # NA


## ----------------------------------------------------------------
flights %>%
  group_by(year, month, day) %>%
  select(arr_delay, dep_delay, year, month, day) %>%
  summarise(arr = mean(arr_delay, na.rm = TRUE), dep = mean(dep_delay, na.rm = TRUE)) %>%
  filter(arr > 50 & dep > 50)


## ----------------------------------------------------------------
name<-data.frame(class = c(1, 2, 3, 4, 5),
                   teacher = c("kim", "lee", "park", "choi", "jung"))
name

exam_new<-left_join(exam, name, by = "class")
head(exam_new, n=10)


## ----------------------------------------------------------------
group_a <- data.frame(id = c(1, 2, 3, 4, 5), test = c(60, 80, 70, 90, 85))

group_b <- data.frame(id = c(5, 7, 8), test = c(65, 80, 90))

group_all <- bind_rows(group_a, group_b)
group_all


## ----------------------------------------------------------------
bind_rows(data.frame(x = 1:3), data.frame(y = 1:4))


## ----------------------------------------------------------------
payroll<-read.csv("DataSet/payroll.csv")
head(payroll, n=7)


## ----------------------------------------------------------------
payroll2<-read.csv("DataSet/payroll2.csv")
head(payroll2, n=7)


## ----------------------------------------------------------------
payroll$BirthD<-as.Date(as.character(payroll$Birth), '%Y/%m/%d')
payroll$BirthD[1:5]
str(payroll)


## ----------------------------------------------------------------
min_b<-payroll %>% group_by(Gender) %>% summarize(BirthD = min(BirthD))
min_b


## ----------------------------------------------------------------
left_join(min_b, payroll, by="BirthD")


## ----------------------------------------------------------------
payroll$Age<-floor((Sys.Date()-payroll$BirthD)/ 365.25)
payroll %>% group_by(Jobcode) %>% summarize(avg_age = round(mean(Age), digits=0), avg_salary = mean(Salary))


## ----------------------------------------------------------------
names(payroll2)[1]<-names(payroll)[1]
updated<-left_join(payroll, payroll2, by="IdNumber")
updated$salary2<-ifelse(is.na(updated$salary), updated$Salary, updated$salary)
updated %>% select(IdNumber, Gender, Jobcode, Salary, salary, salary2) %>% head(15)

>>>>>>> 5c5a7e65ae3a3edf20e3212427f4d26207c4addc
=======

help(package="MASS")

help(mean)
?mean

help(cars)
?cars

help(quine, package="MASS")

## ----------------------------------------------------------------

installed.packages()
installed.packages()[, 1]

install.packages("ggplot2")
library(ggplot2)

if(!require(ggplot2)) install.packages('ggplot2')
installed.packages()[, 1]

## ----------------------------------------------------------------
(a<-3)
(.a<-4)
(A<-5)


## ----------------------------------------------------------------
# 1.a<-6 # error


## ----------------------------------------------------------------
a<-3; b<-4
a+b


## ----------------------------------------------------------------
x<-10; y <-5; z<-3;
x+y
x-y
x*y + z
x/y
y^2
y%/%z # 몫
y%% z # 나머지


## ----------------------------------------------------------------
(c<-"Hello")


## ----------------------------------------------------------------
c1<-"South Africa"
nchar(c1)


## ----------------------------------------------------------------
substr(c1,1,5)
substr(c1,7,12)


## ----------------------------------------------------------------
(x<-NA)
is.na(x)


## ----------------------------------------------------------------
10/0


## ----------------------------------------------------------------
0/0
Inf-Inf
is.nan(0/0)
is.nan(3) # 비교 


## ----------------------------------------------------------------
v1<-c(1,2,NA)
v2<-c("a", "b", "c")
v3<-c("d", "e")
v4<-c(v2,v3)
(v5<-c(1,2,"a")) # 숫자 원소들을 문자로 형식 자동 변환


## ----------------------------------------------------------------
c(v2, v3, c("apple", "pie"))


## ----------------------------------------------------------------
10:15
4:-2
seq(from = 1, to = 10, by = 2)
seq(from=1, to=2, length.out=5)
rep(1, times = 5)
rep(c(1,2), times = 2)


## ----------------------------------------------------------------
v<-c(3, pi, 4)
v[3] # 3번째 원소 선택


## ----------------------------------------------------------------
v<-c(3, pi, 4)
names(v)<-c("num1", "num2", "num3")
v["num1"]


## ----------------------------------------------------------------
v[-1] # 1번째 원소 제외
v[2:3] # 2, 3번째 원소 선택
v[c(1,3)] # 1, 3 번째 원소 선택
v[c("num1", "num3")]


## ----------------------------------------------------------------
v<-c(3, pi, 4)
w<-c(pi, pi, pi)

v == w


## ----------------------------------------------------------------
v[v==w]
v[v<=w]


## ----------------------------------------------------------------
any(v==pi)
all(v==pi)


## ----------------------------------------------------------------
new.v<-c(v, NA)
is.na(new.v)


## ----------------------------------------------------------------
new.v[!is.na(new.v)]  


## ----------------------------------------------------------------
length(w)
NROW(w)


## ----------------------------------------------------------------
nrow(w)


## ----------------------------------------------------------------
LETTERS
length(LETTERS)
LETTERS[1:3]


## ----------------------------------------------------------------
paste("Today is", date())

paste("1st", "2nd", "3rd", sep = ", ")

paste("1st", "2nd", "3rd", sep = "")


## ----------------------------------------------------------------
(blood.v<-rep(c("O", "AB", "A"), length.out=10))
(blood.f1<-factor(blood.v))
table(blood.f1)
(blood.f2<-factor(blood.v, levels=c("A", "B", "AB", "O")))
table(blood.f2)
(blood.f3<-factor(blood.f2)) #벡터에서 사용되지 않는 값은 레벨에서 삭제함  


## ----------------------------------------------------------------
fac1<-factor(LETTERS[1:5])
fac2<-factor(LETTERS[1:5], levels=c("C", "D", "E", "B", "A"))
table(fac1)
table(fac2)


## ----------------------------------------------------------------
fac3<-factor(1:3, labels=c("A", "B", "C"))
table(fac3)


## ----------------------------------------------------------------
matrix(1:12, nrow = 3)
matrix(1:12, nrow = 3, byrow=TRUE)


## ----------------------------------------------------------------
x<-matrix(1:12, ncol = 3)
nrow(x)
ncol(x)
dim(x)


## ----------------------------------------------------------------
v1<-1:4
v2<-5:8
cbind(v1,v2) # column bind
rbind(v1,v2) # row bind


## ----------------------------------------------------------------
x<-matrix(1:8, ncol = 4)
x[1,2]
x[2,3]
x[, 1:2]
x[, c(1,4)]
x[-1,]


## ----------------------------------------------------------------
rownames(x)<-c("r1", "r2")
x
colnames(x)<-c("c1", "c2", "c3", "c4")
x
x["r1",]
x[, c("c1", "c3")]


## ----------------------------------------------------------------
x <- c(100, 75, 80)
y <- c("10452", "10455", "10565")
z <- data.frame(score=x, ID=y)
z


## ----------------------------------------------------------------
z$score
z$ID


## ----------------------------------------------------------------
z$name<-c("Mike", "Tony", "Evan")
z


## ----------------------------------------------------------------
colnames(z)


## ----------------------------------------------------------------
str(z)


## ----------------------------------------------------------------
z[1,2]
z[1,]
z[, c("name", "ID")]


## ----------------------------------------------------------------
library(MASS) # 내장된 MASS library를 loading
head(Cars93, n=3)


## ----------------------------------------------------------------
str(Cars93)


## ----------------------------------------------------------------
Hong <- list(kor.name="길동", eng.name="Gil-dong", age=40, married=T, no.child=2, child.ages=c(3, 7))
Hong


## ----------------------------------------------------------------
Hong$age
Hong$kor.name
Hong$child.ages

Hong[[3]] # 두 겹 괄호로 리스트의 부분 추출 가능
Hong[c(1,2)] # 여러 개를 추출할 때는 한겹 괄호



## ----------------------------------------------------------------
is.list(Hong)

class(MASS::Cars93)
x<-matrix(1:9, ncol = 3)
class(x)
x
newx<-as.data.frame(x)
class(newx)
is.matrix(newx)


## ----------------------------------------------------------------
is.data.frame(newx)
names(newx)
newx$V1


## ----------------------------------------------------------------
data1<-read.table(file="D:/Dropbox/StatCourses/R_bigdata_202108/DataSet/KOSPI.csv", 
                  header=T, sep=",")


## ----------------------------------------------------------------
colnames(data1)
dim(data1)
str(data1)
head(data1, n=3)
tail(data1, n=3)


## ----------------------------------------------------------------
data1$newDate<-as.Date(data1$Date)
str(data1)


## ----------------------------------------------------------------
data1$Date[10] - data1$Date[1]
data1$newDate[10] - data1$newDate[1]

data1$newDate[10]
data1$newDate[1]
data1$newDate[1]+11


## ----------------------------------------------------------------
strDates <- c("01/05/2010", "08/16/1995")
as.Date(strDates) # 제대로 인식 못함 
as.Date(strDates, "%m/%d/%Y") # 형식 적용 



## ----------------------------------------------------------------
(today <- Sys.Date())
format(today, "%B %d %Y")
format(Sys.Date(), "%a %b %d")


## ----------------------------------------------------------------
getwd()


## ----------------------------------------------------------------
setwd("D:/Dropbox/StatCourses/R_bigdata_202108/")
getwd()

data1new<-read.table(file="DataSet/KOSPI.csv", header=T, sep=",")

colnames(data1new)


## ----------------------------------------------------------------
data2<-read.csv(file="DataSet/KOSPI.csv") 
all(data1new==data2) 


## ----------------------------------------------------------------
tab_dat<-read.table("DataSet/hsb2.txt", header=T, sep="\t")
tab_dat[1:3, ]


## ----------------------------------------------------------------
if (!require('readxl')) install.packages('readxl') 
library('readxl')

data5<-read_excel("DataSet/excel_exam.xlsx") 


## ----------------------------------------------------------------
data6<-read_excel("DataSet/excel_exam_sheet.xlsx", sheet=3) 


## ----------------------------------------------------------------
save(data1, tab_dat, file="Output/newR.Rdata")


## ----------------------------------------------------------------
load(file="Output/newR.Rdata")


## ----------------------------------------------------------------
write.csv(data1, file="Output/data1_1.csv", row.names=T)
write.csv(data1, file="Output/data1_2.csv", row.names=F)

write.table(data1, file="Output/data1_3.txt")


## ----------------------------------------------------------------
subset(Cars93, select=c(Model, MPG.city, AirBags), subset=(MPG.city>30))
sub<-subset(Cars93, select=c(Model, MPG.city, AirBags), subset=(MPG.city>30 & AirBags !="None"))
sub
subset(sub, select=-AirBags)


## ----------------------------------------------------------------
attach(MASS::Cars93)
table(Type, DriveTrain)



## ----------------------------------------------------------------
detach(MASS::Cars93)


## ----------------------------------------------------------------
library(MASS)
table(Cars93$Type, Cars93$DriveTrain)
with(Cars93, table(Type, DriveTrain))


## ----------------------------------------------------------------
table(Cars93$AirBags)
Cars93[Cars93$AirBags == "Driver & Passenger", 1:2]


## ----------------------------------------------------------------
(idx<-which(Cars93$AirBags == "Driver & Passenger"))
Cars93[idx, 1:2]


## ----------------------------------------------------------------
for(i in 1:3){
  print(paste("i=", i))
}


## ----------------------------------------------------------------
for(i in 1:5){
  if(i %% 2 == 0){
    print('짝수')
  }
  else{
    print('홀수')
  }
}


## ----------------------------------------------------------------
w1<-1:5
ifelse(w1 %% 2 == 0, "짝수", "홀수")


## ----------------------------------------------------------------
x <- list(a = 1:10, beta = exp(-3:3))
(y<-lapply(x, mean))
(z<-sapply(x, mean))
y$a
z[1]


## ----------------------------------------------------------------
(mat <- cbind(x1 = 3, x2 = c(3:1, 2:4)))
rownames(mat)<-letters[1:6]
apply(mat, 1, mean)
apply(mat, 2, mean)


## ----------------------------------------------------------------
tapply(Cars93$Price, Cars93$Type, mean)
#with(Cars93, tapply(Price, Type, mean))


## ----------------------------------------------------------------
aggregate(Price ~ Type, Cars93, mean)


## ----------------------------------------------------------------
## ----------------------------------------------------------------

library(dplyr)

## ----------------------------------------------------------------
exam<-read.csv("DataSet/csv_exam.csv")

exam %>% filter(class == 1)


## ----------------------------------------------------------------
exam %>% filter(class %in% c(1,3))


## ----------------------------------------------------------------
exam %>% filter(math >= 90 | english >= 90)


## ----------------------------------------------------------------
exam %>% filter(class == 2 & english >= 80)
# exam %>% filter(class == 2, english >= 80) 


## ----------------------------------------------------------------
class1<-exam %>% filter(class == 1)
mean(class1$english)


## ----------------------------------------------------------------
df <- data.frame(sex = c("M", "F", NA, "M", "F"),
                 score = c(5, 4, 3, 4, NA))
df

is.na(df)               # 결측치 확인
table(is.na(df))        # 결측치 빈도 출력
table(is.na(df$sex))  # sex 결측치 빈도 출력


## ----------------------------------------------------------------
df[is.na(df$sex), ]

df %>% filter(is.na(sex))


## ----------------------------------------------------------------
df[!is.na(df$sex), ]

df %>% filter(!is.na(sex))


## ----------------------------------------------------------------
df[!is.na(df$sex)&!is.na(df$score), ]

df %>% filter(!is.na(sex)&!is.na(score))


## ----------------------------------------------------------------
na.omit(df)


## ----------------------------------------------------------------
mean(c(1,2,3, NA))
mean(c(1,2,3, NA), na.rm=T)


## ----------------------------------------------------------------
select<- dplyr::select
exam %>% select(class, math, english) %>% head(3)


## ----------------------------------------------------------------
exam %>% select(classroom=class, math, english) %>% head(3)


## ----------------------------------------------------------------
exam %>% rename(classroom=class) %>% head(3)


## ----------------------------------------------------------------
exam %>% select(-math) %>% head(5)


## ----------------------------------------------------------------
exam %>% select(-math, -english) %>% head(5)


## ----------------------------------------------------------------
exam %>% select(-(math:science)) %>% head(5)


## ----------------------------------------------------------------
exam %>% arrange(math)


## ----------------------------------------------------------------
exam %>% arrange(desc(math)) %>% head(10)


## ----------------------------------------------------------------
exam %>% arrange(english, math) %>% head(10)


## ----------------------------------------------------------------
exam %>% top_n(5, math)


## ----------------------------------------------------------------
exam %>% arrange(desc(math)) %>% head(5)


## ----------------------------------------------------------------
exam %>%
  mutate(average = (math + english + science)/3) %>%
  head


## ----------------------------------------------------------------
exam %>%
  mutate(average = (math + english + science)/3) %>%
  arrange(average) %>%
  head


## ----------------------------------------------------------------
head(exam, n=10)

new_exam<-exam %>% mutate(test=ifelse(science >=70, "pass", "fail"))

head(new_exam, n=10)


## ----------------------------------------------------------------
exam %>% summarise(mean_sc = mean(science))


## ----------------------------------------------------------------
exam %>% summarise(mean_math = mean(math),
            sum_math = sum(math),
            median_math = median(math),
            n = n())


## ----------------------------------------------------------------
exam %>% summarise(class=n_distinct(class))
table(exam$class)


## ----------------------------------------------------------------
exam %>% group_by(class) %>%
  summarise(mean_sc = mean(science))


## ----------------------------------------------------------------
exam %>% group_by(class) %>%
  summarise(mean_math = mean(math),
            median_math = median(math),
            n = n())


## ----------------------------------------------------------------
exam %>% sample_n(7)


## ----------------------------------------------------------------
exam %>% sample_frac(0.2)


## ----------------------------------------------------------------
library(nycflights13)


## ----eval=F------------------------------------------------------
## ?flights # 도움말


## ----------------------------------------------------------------
str(flights)


## ----------------------------------------------------------------
flights %>% filter(month == 1, day == 1) %>% head(5)


## ----------------------------------------------------------------
df <- flights %>% filter(month == 1 & day %in% c(3, 4))
nrow(df)

flights %>% filter(month == 1 & day %in% c(3, 4)) %>%  summarize(n=n())


## ----------------------------------------------------------------
arrange(flights, year, month, day) %>% head(5)


## ----------------------------------------------------------------
arrange(flights, desc(dep_delay)) %>% head(5)


## ----------------------------------------------------------------
flights  %>%  select(year, month, day) %>% head(3)

flights %>% select(year:day) %>% head(3)


## ----------------------------------------------------------------
select(flights, -(year:day)) %>% head(3)


## ----------------------------------------------------------------
flights %>%  select(tail_num = tailnum) %>% head(5)


## ----------------------------------------------------------------
flights %>%  rename(tail_num = tailnum) %>% head(5)


## ----------------------------------------------------------------
flights %>% mutate(gain = arr_delay - dep_delay, speed = distance * 60 / air_time) %>%  head(3)


## ----------------------------------------------------------------
f1<-mutate(flights, gain = arr_delay - dep_delay, speed = distance * 60 / air_time)
colnames(f1)


## ----------------------------------------------------------------
flights %>%  summarise(delay = mean(dep_delay, na.rm = TRUE))

#summarise(flights, delay = mean(dep_delay)) # NA


## ----------------------------------------------------------------
flights %>%
  group_by(year, month, day) %>%
  select(arr_delay, dep_delay, year, month, day) %>%
  summarise(arr = mean(arr_delay, na.rm = TRUE), dep = mean(dep_delay, na.rm = TRUE)) %>%
  filter(arr > 50 & dep > 50)


## ----------------------------------------------------------------
name<-data.frame(class = c(1, 2, 3, 4, 5),
                   teacher = c("kim", "lee", "park", "choi", "jung"))
name

exam_new<-left_join(exam, name, by = "class")
head(exam_new, n=10)


## ----------------------------------------------------------------
group_a <- data.frame(id = c(1, 2, 3, 4, 5), test = c(60, 80, 70, 90, 85))

group_b <- data.frame(id = c(5, 7, 8), test = c(65, 80, 90))

group_all <- bind_rows(group_a, group_b)
group_all


## ----------------------------------------------------------------
bind_rows(data.frame(x = 1:3), data.frame(y = 1:4))


## ----------------------------------------------------------------
payroll<-read.csv("DataSet/payroll.csv")
head(payroll, n=7)


## ----------------------------------------------------------------
payroll2<-read.csv("DataSet/payroll2.csv")
head(payroll2, n=7)


## ----------------------------------------------------------------
payroll$BirthD<-as.Date(as.character(payroll$Birth), '%Y/%m/%d')
payroll$BirthD[1:5]
str(payroll)


## ----------------------------------------------------------------
min_b<-payroll %>% group_by(Gender) %>% summarize(BirthD = min(BirthD))
min_b


## ----------------------------------------------------------------
left_join(min_b, payroll, by="BirthD")


## ----------------------------------------------------------------
payroll$Age<-floor((Sys.Date()-payroll$BirthD)/ 365.25)
payroll %>% group_by(Jobcode) %>% summarize(avg_age = round(mean(Age), digits=0), avg_salary = mean(Salary))


## ----------------------------------------------------------------
names(payroll2)[1]<-names(payroll)[1]
updated<-left_join(payroll, payroll2, by="IdNumber")
updated$salary2<-ifelse(is.na(updated$salary), updated$Salary, updated$salary)
updated %>% select(IdNumber, Gender, Jobcode, Salary, salary, salary2) %>% head(15)

>>>>>>> 5c5a7e65ae3a3edf20e3212427f4d26207c4addc
=======

help(package="MASS")

help(mean)
?mean

help(cars)
?cars

help(quine, package="MASS")

## ----------------------------------------------------------------

installed.packages()
installed.packages()[, 1]

install.packages("ggplot2")
library(ggplot2)

if(!require(ggplot2)) install.packages('ggplot2')
installed.packages()[, 1]

## ----------------------------------------------------------------
(a<-3)
(.a<-4)
(A<-5)


## ----------------------------------------------------------------
# 1.a<-6 # error


## ----------------------------------------------------------------
a<-3; b<-4
a+b


## ----------------------------------------------------------------
x<-10; y <-5; z<-3;
x+y
x-y
x*y + z
x/y
y^2
y%/%z # 몫
y%% z # 나머지


## ----------------------------------------------------------------
(c<-"Hello")


## ----------------------------------------------------------------
c1<-"South Africa"
nchar(c1)


## ----------------------------------------------------------------
substr(c1,1,5)
substr(c1,7,12)


## ----------------------------------------------------------------
(x<-NA)
is.na(x)


## ----------------------------------------------------------------
10/0


## ----------------------------------------------------------------
0/0
Inf-Inf
is.nan(0/0)
is.nan(3) # 비교 


## ----------------------------------------------------------------
v1<-c(1,2,NA)
v2<-c("a", "b", "c")
v3<-c("d", "e")
v4<-c(v2,v3)
(v5<-c(1,2,"a")) # 숫자 원소들을 문자로 형식 자동 변환


## ----------------------------------------------------------------
c(v2, v3, c("apple", "pie"))


## ----------------------------------------------------------------
10:15
4:-2
seq(from = 1, to = 10, by = 2)
seq(from=1, to=2, length.out=5)
rep(1, times = 5)
rep(c(1,2), times = 2)


## ----------------------------------------------------------------
v<-c(3, pi, 4)
v[3] # 3번째 원소 선택


## ----------------------------------------------------------------
v<-c(3, pi, 4)
names(v)<-c("num1", "num2", "num3")
v["num1"]


## ----------------------------------------------------------------
v[-1] # 1번째 원소 제외
v[2:3] # 2, 3번째 원소 선택
v[c(1,3)] # 1, 3 번째 원소 선택
v[c("num1", "num3")]


## ----------------------------------------------------------------
v<-c(3, pi, 4)
w<-c(pi, pi, pi)

v == w


## ----------------------------------------------------------------
v[v==w]
v[v<=w]


## ----------------------------------------------------------------
any(v==pi)
all(v==pi)


## ----------------------------------------------------------------
new.v<-c(v, NA)
is.na(new.v)


## ----------------------------------------------------------------
new.v[!is.na(new.v)]  


## ----------------------------------------------------------------
length(w)
NROW(w)


## ----------------------------------------------------------------
nrow(w)


## ----------------------------------------------------------------
LETTERS
length(LETTERS)
LETTERS[1:3]


## ----------------------------------------------------------------
paste("Today is", date())

paste("1st", "2nd", "3rd", sep = ", ")

paste("1st", "2nd", "3rd", sep = "")


## ----------------------------------------------------------------
(blood.v<-rep(c("O", "AB", "A"), length.out=10))
(blood.f1<-factor(blood.v))
table(blood.f1)
(blood.f2<-factor(blood.v, levels=c("A", "B", "AB", "O")))
table(blood.f2)
(blood.f3<-factor(blood.f2)) #벡터에서 사용되지 않는 값은 레벨에서 삭제함  


## ----------------------------------------------------------------
fac1<-factor(LETTERS[1:5])
fac2<-factor(LETTERS[1:5], levels=c("C", "D", "E", "B", "A"))
table(fac1)
table(fac2)


## ----------------------------------------------------------------
fac3<-factor(1:3, labels=c("A", "B", "C"))
table(fac3)


## ----------------------------------------------------------------
matrix(1:12, nrow = 3)
matrix(1:12, nrow = 3, byrow=TRUE)


## ----------------------------------------------------------------
x<-matrix(1:12, ncol = 3)
nrow(x)
ncol(x)
dim(x)


## ----------------------------------------------------------------
v1<-1:4
v2<-5:8
cbind(v1,v2) # column bind
rbind(v1,v2) # row bind


## ----------------------------------------------------------------
x<-matrix(1:8, ncol = 4)
x[1,2]
x[2,3]
x[, 1:2]
x[, c(1,4)]
x[-1,]


## ----------------------------------------------------------------
rownames(x)<-c("r1", "r2")
x
colnames(x)<-c("c1", "c2", "c3", "c4")
x
x["r1",]
x[, c("c1", "c3")]


## ----------------------------------------------------------------
x <- c(100, 75, 80)
y <- c("10452", "10455", "10565")
z <- data.frame(score=x, ID=y)
z


## ----------------------------------------------------------------
z$score
z$ID


## ----------------------------------------------------------------
z$name<-c("Mike", "Tony", "Evan")
z


## ----------------------------------------------------------------
colnames(z)


## ----------------------------------------------------------------
str(z)


## ----------------------------------------------------------------
z[1,2]
z[1,]
z[, c("name", "ID")]


## ----------------------------------------------------------------
library(MASS) # 내장된 MASS library를 loading
head(Cars93, n=3)


## ----------------------------------------------------------------
str(Cars93)


## ----------------------------------------------------------------
Hong <- list(kor.name="길동", eng.name="Gil-dong", age=40, married=T, no.child=2, child.ages=c(3, 7))
Hong


## ----------------------------------------------------------------
Hong$age
Hong$kor.name
Hong$child.ages

Hong[[3]] # 두 겹 괄호로 리스트의 부분 추출 가능
Hong[c(1,2)] # 여러 개를 추출할 때는 한겹 괄호



## ----------------------------------------------------------------
is.list(Hong)

class(MASS::Cars93)
x<-matrix(1:9, ncol = 3)
class(x)
x
newx<-as.data.frame(x)
class(newx)
is.matrix(newx)


## ----------------------------------------------------------------
is.data.frame(newx)
names(newx)
newx$V1


## ----------------------------------------------------------------
data1<-read.table(file="D:/Dropbox/StatCourses/R_bigdata_202108/DataSet/KOSPI.csv", 
                  header=T, sep=",")


## ----------------------------------------------------------------
colnames(data1)
dim(data1)
str(data1)
head(data1, n=3)
tail(data1, n=3)


## ----------------------------------------------------------------
data1$newDate<-as.Date(data1$Date)
str(data1)


## ----------------------------------------------------------------
data1$Date[10] - data1$Date[1]
data1$newDate[10] - data1$newDate[1]

data1$newDate[10]
data1$newDate[1]
data1$newDate[1]+11


## ----------------------------------------------------------------
strDates <- c("01/05/2010", "08/16/1995")
as.Date(strDates) # 제대로 인식 못함 
as.Date(strDates, "%m/%d/%Y") # 형식 적용 



## ----------------------------------------------------------------
(today <- Sys.Date())
format(today, "%B %d %Y")
format(Sys.Date(), "%a %b %d")


## ----------------------------------------------------------------
getwd()


## ----------------------------------------------------------------
setwd("D:/Dropbox/StatCourses/R_bigdata_202108/")
getwd()

data1new<-read.table(file="DataSet/KOSPI.csv", header=T, sep=",")

colnames(data1new)


## ----------------------------------------------------------------
data2<-read.csv(file="DataSet/KOSPI.csv") 
all(data1new==data2) 


## ----------------------------------------------------------------
tab_dat<-read.table("DataSet/hsb2.txt", header=T, sep="\t")
tab_dat[1:3, ]


## ----------------------------------------------------------------
if (!require('readxl')) install.packages('readxl') 
library('readxl')

data5<-read_excel("DataSet/excel_exam.xlsx") 


## ----------------------------------------------------------------
data6<-read_excel("DataSet/excel_exam_sheet.xlsx", sheet=3) 


## ----------------------------------------------------------------
save(data1, tab_dat, file="Output/newR.Rdata")


## ----------------------------------------------------------------
load(file="Output/newR.Rdata")


## ----------------------------------------------------------------
write.csv(data1, file="Output/data1_1.csv", row.names=T)
write.csv(data1, file="Output/data1_2.csv", row.names=F)

write.table(data1, file="Output/data1_3.txt")


## ----------------------------------------------------------------
subset(Cars93, select=c(Model, MPG.city, AirBags), subset=(MPG.city>30))
sub<-subset(Cars93, select=c(Model, MPG.city, AirBags), subset=(MPG.city>30 & AirBags !="None"))
sub
subset(sub, select=-AirBags)


## ----------------------------------------------------------------
attach(MASS::Cars93)
table(Type, DriveTrain)



## ----------------------------------------------------------------
detach(MASS::Cars93)


## ----------------------------------------------------------------
library(MASS)
table(Cars93$Type, Cars93$DriveTrain)
with(Cars93, table(Type, DriveTrain))


## ----------------------------------------------------------------
table(Cars93$AirBags)
Cars93[Cars93$AirBags == "Driver & Passenger", 1:2]


## ----------------------------------------------------------------
(idx<-which(Cars93$AirBags == "Driver & Passenger"))
Cars93[idx, 1:2]


## ----------------------------------------------------------------
for(i in 1:3){
  print(paste("i=", i))
}


## ----------------------------------------------------------------
for(i in 1:5){
  if(i %% 2 == 0){
    print('짝수')
  }
  else{
    print('홀수')
  }
}


## ----------------------------------------------------------------
w1<-1:5
ifelse(w1 %% 2 == 0, "짝수", "홀수")


## ----------------------------------------------------------------
x <- list(a = 1:10, beta = exp(-3:3))
(y<-lapply(x, mean))
(z<-sapply(x, mean))
y$a
z[1]


## ----------------------------------------------------------------
(mat <- cbind(x1 = 3, x2 = c(3:1, 2:4)))
rownames(mat)<-letters[1:6]
apply(mat, 1, mean)
apply(mat, 2, mean)


## ----------------------------------------------------------------
tapply(Cars93$Price, Cars93$Type, mean)
#with(Cars93, tapply(Price, Type, mean))


## ----------------------------------------------------------------
aggregate(Price ~ Type, Cars93, mean)


## ----------------------------------------------------------------
## ----------------------------------------------------------------

library(dplyr)

## ----------------------------------------------------------------
exam<-read.csv("DataSet/csv_exam.csv")

exam %>% filter(class == 1)


## ----------------------------------------------------------------
exam %>% filter(class %in% c(1,3))


## ----------------------------------------------------------------
exam %>% filter(math >= 90 | english >= 90)


## ----------------------------------------------------------------
exam %>% filter(class == 2 & english >= 80)
# exam %>% filter(class == 2, english >= 80) 


## ----------------------------------------------------------------
class1<-exam %>% filter(class == 1)
mean(class1$english)


## ----------------------------------------------------------------
df <- data.frame(sex = c("M", "F", NA, "M", "F"),
                 score = c(5, 4, 3, 4, NA))
df

is.na(df)               # 결측치 확인
table(is.na(df))        # 결측치 빈도 출력
table(is.na(df$sex))  # sex 결측치 빈도 출력


## ----------------------------------------------------------------
df[is.na(df$sex), ]

df %>% filter(is.na(sex))


## ----------------------------------------------------------------
df[!is.na(df$sex), ]

df %>% filter(!is.na(sex))


## ----------------------------------------------------------------
df[!is.na(df$sex)&!is.na(df$score), ]

df %>% filter(!is.na(sex)&!is.na(score))


## ----------------------------------------------------------------
na.omit(df)


## ----------------------------------------------------------------
mean(c(1,2,3, NA))
mean(c(1,2,3, NA), na.rm=T)


## ----------------------------------------------------------------
select<- dplyr::select
exam %>% select(class, math, english) %>% head(3)


## ----------------------------------------------------------------
exam %>% select(classroom=class, math, english) %>% head(3)


## ----------------------------------------------------------------
exam %>% rename(classroom=class) %>% head(3)


## ----------------------------------------------------------------
exam %>% select(-math) %>% head(5)


## ----------------------------------------------------------------
exam %>% select(-math, -english) %>% head(5)


## ----------------------------------------------------------------
exam %>% select(-(math:science)) %>% head(5)


## ----------------------------------------------------------------
exam %>% arrange(math)


## ----------------------------------------------------------------
exam %>% arrange(desc(math)) %>% head(10)


## ----------------------------------------------------------------
exam %>% arrange(english, math) %>% head(10)


## ----------------------------------------------------------------
exam %>% top_n(5, math)


## ----------------------------------------------------------------
exam %>% arrange(desc(math)) %>% head(5)


## ----------------------------------------------------------------
exam %>%
  mutate(average = (math + english + science)/3) %>%
  head


## ----------------------------------------------------------------
exam %>%
  mutate(average = (math + english + science)/3) %>%
  arrange(average) %>%
  head


## ----------------------------------------------------------------
head(exam, n=10)

new_exam<-exam %>% mutate(test=ifelse(science >=70, "pass", "fail"))

head(new_exam, n=10)


## ----------------------------------------------------------------
exam %>% summarise(mean_sc = mean(science))


## ----------------------------------------------------------------
exam %>% summarise(mean_math = mean(math),
            sum_math = sum(math),
            median_math = median(math),
            n = n())


## ----------------------------------------------------------------
exam %>% summarise(class=n_distinct(class))
table(exam$class)


## ----------------------------------------------------------------
exam %>% group_by(class) %>%
  summarise(mean_sc = mean(science))


## ----------------------------------------------------------------
exam %>% group_by(class) %>%
  summarise(mean_math = mean(math),
            median_math = median(math),
            n = n())


## ----------------------------------------------------------------
exam %>% sample_n(7)


## ----------------------------------------------------------------
exam %>% sample_frac(0.2)


## ----------------------------------------------------------------
library(nycflights13)


## ----eval=F------------------------------------------------------
## ?flights # 도움말


## ----------------------------------------------------------------
str(flights)


## ----------------------------------------------------------------
flights %>% filter(month == 1, day == 1) %>% head(5)


## ----------------------------------------------------------------
df <- flights %>% filter(month == 1 & day %in% c(3, 4))
nrow(df)

flights %>% filter(month == 1 & day %in% c(3, 4)) %>%  summarize(n=n())


## ----------------------------------------------------------------
arrange(flights, year, month, day) %>% head(5)


## ----------------------------------------------------------------
arrange(flights, desc(dep_delay)) %>% head(5)


## ----------------------------------------------------------------
flights  %>%  select(year, month, day) %>% head(3)

flights %>% select(year:day) %>% head(3)


## ----------------------------------------------------------------
select(flights, -(year:day)) %>% head(3)


## ----------------------------------------------------------------
flights %>%  select(tail_num = tailnum) %>% head(5)


## ----------------------------------------------------------------
flights %>%  rename(tail_num = tailnum) %>% head(5)


## ----------------------------------------------------------------
flights %>% mutate(gain = arr_delay - dep_delay, speed = distance * 60 / air_time) %>%  head(3)


## ----------------------------------------------------------------
f1<-mutate(flights, gain = arr_delay - dep_delay, speed = distance * 60 / air_time)
colnames(f1)


## ----------------------------------------------------------------
flights %>%  summarise(delay = mean(dep_delay, na.rm = TRUE))

#summarise(flights, delay = mean(dep_delay)) # NA


## ----------------------------------------------------------------
flights %>%
  group_by(year, month, day) %>%
  select(arr_delay, dep_delay, year, month, day) %>%
  summarise(arr = mean(arr_delay, na.rm = TRUE), dep = mean(dep_delay, na.rm = TRUE)) %>%
  filter(arr > 50 & dep > 50)


## ----------------------------------------------------------------
name<-data.frame(class = c(1, 2, 3, 4, 5),
                   teacher = c("kim", "lee", "park", "choi", "jung"))
name

exam_new<-left_join(exam, name, by = "class")
head(exam_new, n=10)


## ----------------------------------------------------------------
group_a <- data.frame(id = c(1, 2, 3, 4, 5), test = c(60, 80, 70, 90, 85))

group_b <- data.frame(id = c(5, 7, 8), test = c(65, 80, 90))

group_all <- bind_rows(group_a, group_b)
group_all


## ----------------------------------------------------------------
bind_rows(data.frame(x = 1:3), data.frame(y = 1:4))


## ----------------------------------------------------------------
payroll<-read.csv("DataSet/payroll.csv")
head(payroll, n=7)


## ----------------------------------------------------------------
payroll2<-read.csv("DataSet/payroll2.csv")
head(payroll2, n=7)


## ----------------------------------------------------------------
payroll$BirthD<-as.Date(as.character(payroll$Birth), '%Y/%m/%d')
payroll$BirthD[1:5]
str(payroll)


## ----------------------------------------------------------------
min_b<-payroll %>% group_by(Gender) %>% summarize(BirthD = min(BirthD))
min_b


## ----------------------------------------------------------------
left_join(min_b, payroll, by="BirthD")


## ----------------------------------------------------------------
payroll$Age<-floor((Sys.Date()-payroll$BirthD)/ 365.25)
payroll %>% group_by(Jobcode) %>% summarize(avg_age = round(mean(Age), digits=0), avg_salary = mean(Salary))


## ----------------------------------------------------------------
names(payroll2)[1]<-names(payroll)[1]
updated<-left_join(payroll, payroll2, by="IdNumber")
updated$salary2<-ifelse(is.na(updated$salary), updated$Salary, updated$salary)
updated %>% select(IdNumber, Gender, Jobcode, Salary, salary, salary2) %>% head(15)

>>>>>>> 5c5a7e65ae3a3edf20e3212427f4d26207c4addc
=======

help(package="MASS")

help(mean)
?mean

help(cars)
?cars

help(quine, package="MASS")

## ----------------------------------------------------------------

installed.packages()
installed.packages()[, 1]

install.packages("ggplot2")
library(ggplot2)

if(!require(ggplot2)) install.packages('ggplot2')
installed.packages()[, 1]

## ----------------------------------------------------------------
(a<-3)
(.a<-4)
(A<-5)


## ----------------------------------------------------------------
# 1.a<-6 # error


## ----------------------------------------------------------------
a<-3; b<-4
a+b


## ----------------------------------------------------------------
x<-10; y <-5; z<-3;
x+y
x-y
x*y + z
x/y
y^2
y%/%z # 몫
y%% z # 나머지


## ----------------------------------------------------------------
(c<-"Hello")


## ----------------------------------------------------------------
c1<-"South Africa"
nchar(c1)


## ----------------------------------------------------------------
substr(c1,1,5)
substr(c1,7,12)


## ----------------------------------------------------------------
(x<-NA)
is.na(x)


## ----------------------------------------------------------------
10/0


## ----------------------------------------------------------------
0/0
Inf-Inf
is.nan(0/0)
is.nan(3) # 비교 


## ----------------------------------------------------------------
v1<-c(1,2,NA)
v2<-c("a", "b", "c")
v3<-c("d", "e")
v4<-c(v2,v3)
(v5<-c(1,2,"a")) # 숫자 원소들을 문자로 형식 자동 변환


## ----------------------------------------------------------------
c(v2, v3, c("apple", "pie"))


## ----------------------------------------------------------------
10:15
4:-2
seq(from = 1, to = 10, by = 2)
seq(from=1, to=2, length.out=5)
rep(1, times = 5)
rep(c(1,2), times = 2)


## ----------------------------------------------------------------
v<-c(3, pi, 4)
v[3] # 3번째 원소 선택


## ----------------------------------------------------------------
v<-c(3, pi, 4)
names(v)<-c("num1", "num2", "num3")
v["num1"]


## ----------------------------------------------------------------
v[-1] # 1번째 원소 제외
v[2:3] # 2, 3번째 원소 선택
v[c(1,3)] # 1, 3 번째 원소 선택
v[c("num1", "num3")]


## ----------------------------------------------------------------
v<-c(3, pi, 4)
w<-c(pi, pi, pi)

v == w


## ----------------------------------------------------------------
v[v==w]
v[v<=w]


## ----------------------------------------------------------------
any(v==pi)
all(v==pi)


## ----------------------------------------------------------------
new.v<-c(v, NA)
is.na(new.v)


## ----------------------------------------------------------------
new.v[!is.na(new.v)]  


## ----------------------------------------------------------------
length(w)
NROW(w)


## ----------------------------------------------------------------
nrow(w)


## ----------------------------------------------------------------
LETTERS
length(LETTERS)
LETTERS[1:3]


## ----------------------------------------------------------------
paste("Today is", date())

paste("1st", "2nd", "3rd", sep = ", ")

paste("1st", "2nd", "3rd", sep = "")


## ----------------------------------------------------------------
(blood.v<-rep(c("O", "AB", "A"), length.out=10))
(blood.f1<-factor(blood.v))
table(blood.f1)
(blood.f2<-factor(blood.v, levels=c("A", "B", "AB", "O")))
table(blood.f2)
(blood.f3<-factor(blood.f2)) #벡터에서 사용되지 않는 값은 레벨에서 삭제함  


## ----------------------------------------------------------------
fac1<-factor(LETTERS[1:5])
fac2<-factor(LETTERS[1:5], levels=c("C", "D", "E", "B", "A"))
table(fac1)
table(fac2)


## ----------------------------------------------------------------
fac3<-factor(1:3, labels=c("A", "B", "C"))
table(fac3)


## ----------------------------------------------------------------
matrix(1:12, nrow = 3)
matrix(1:12, nrow = 3, byrow=TRUE)


## ----------------------------------------------------------------
x<-matrix(1:12, ncol = 3)
nrow(x)
ncol(x)
dim(x)


## ----------------------------------------------------------------
v1<-1:4
v2<-5:8
cbind(v1,v2) # column bind
rbind(v1,v2) # row bind


## ----------------------------------------------------------------
x<-matrix(1:8, ncol = 4)
x[1,2]
x[2,3]
x[, 1:2]
x[, c(1,4)]
x[-1,]


## ----------------------------------------------------------------
rownames(x)<-c("r1", "r2")
x
colnames(x)<-c("c1", "c2", "c3", "c4")
x
x["r1",]
x[, c("c1", "c3")]


## ----------------------------------------------------------------
x <- c(100, 75, 80)
y <- c("10452", "10455", "10565")
z <- data.frame(score=x, ID=y)
z


## ----------------------------------------------------------------
z$score
z$ID


## ----------------------------------------------------------------
z$name<-c("Mike", "Tony", "Evan")
z


## ----------------------------------------------------------------
colnames(z)


## ----------------------------------------------------------------
str(z)


## ----------------------------------------------------------------
z[1,2]
z[1,]
z[, c("name", "ID")]


## ----------------------------------------------------------------
library(MASS) # 내장된 MASS library를 loading
head(Cars93, n=3)


## ----------------------------------------------------------------
str(Cars93)


## ----------------------------------------------------------------
Hong <- list(kor.name="길동", eng.name="Gil-dong", age=40, married=T, no.child=2, child.ages=c(3, 7))
Hong


## ----------------------------------------------------------------
Hong$age
Hong$kor.name
Hong$child.ages

Hong[[3]] # 두 겹 괄호로 리스트의 부분 추출 가능
Hong[c(1,2)] # 여러 개를 추출할 때는 한겹 괄호



## ----------------------------------------------------------------
is.list(Hong)

class(MASS::Cars93)
x<-matrix(1:9, ncol = 3)
class(x)
x
newx<-as.data.frame(x)
class(newx)
is.matrix(newx)


## ----------------------------------------------------------------
is.data.frame(newx)
names(newx)
newx$V1


## ----------------------------------------------------------------
data1<-read.table(file="D:/Dropbox/StatCourses/R_bigdata_202108/DataSet/KOSPI.csv", 
                  header=T, sep=",")


## ----------------------------------------------------------------
colnames(data1)
dim(data1)
str(data1)
head(data1, n=3)
tail(data1, n=3)


## ----------------------------------------------------------------
data1$newDate<-as.Date(data1$Date)
str(data1)


## ----------------------------------------------------------------
data1$Date[10] - data1$Date[1]
data1$newDate[10] - data1$newDate[1]

data1$newDate[10]
data1$newDate[1]
data1$newDate[1]+11


## ----------------------------------------------------------------
strDates <- c("01/05/2010", "08/16/1995")
as.Date(strDates) # 제대로 인식 못함 
as.Date(strDates, "%m/%d/%Y") # 형식 적용 



## ----------------------------------------------------------------
(today <- Sys.Date())
format(today, "%B %d %Y")
format(Sys.Date(), "%a %b %d")


## ----------------------------------------------------------------
getwd()


## ----------------------------------------------------------------
setwd("D:/Dropbox/StatCourses/R_bigdata_202108/")
getwd()

data1new<-read.table(file="DataSet/KOSPI.csv", header=T, sep=",")

colnames(data1new)


## ----------------------------------------------------------------
data2<-read.csv(file="DataSet/KOSPI.csv") 
all(data1new==data2) 


## ----------------------------------------------------------------
tab_dat<-read.table("DataSet/hsb2.txt", header=T, sep="\t")
tab_dat[1:3, ]


## ----------------------------------------------------------------
if (!require('readxl')) install.packages('readxl') 
library('readxl')

data5<-read_excel("DataSet/excel_exam.xlsx") 


## ----------------------------------------------------------------
data6<-read_excel("DataSet/excel_exam_sheet.xlsx", sheet=3) 


## ----------------------------------------------------------------
save(data1, tab_dat, file="Output/newR.Rdata")


## ----------------------------------------------------------------
load(file="Output/newR.Rdata")


## ----------------------------------------------------------------
write.csv(data1, file="Output/data1_1.csv", row.names=T)
write.csv(data1, file="Output/data1_2.csv", row.names=F)

write.table(data1, file="Output/data1_3.txt")


## ----------------------------------------------------------------
subset(Cars93, select=c(Model, MPG.city, AirBags), subset=(MPG.city>30))
sub<-subset(Cars93, select=c(Model, MPG.city, AirBags), subset=(MPG.city>30 & AirBags !="None"))
sub
subset(sub, select=-AirBags)


## ----------------------------------------------------------------
attach(MASS::Cars93)
table(Type, DriveTrain)



## ----------------------------------------------------------------
detach(MASS::Cars93)


## ----------------------------------------------------------------
library(MASS)
table(Cars93$Type, Cars93$DriveTrain)
with(Cars93, table(Type, DriveTrain))


## ----------------------------------------------------------------
table(Cars93$AirBags)
Cars93[Cars93$AirBags == "Driver & Passenger", 1:2]


## ----------------------------------------------------------------
(idx<-which(Cars93$AirBags == "Driver & Passenger"))
Cars93[idx, 1:2]


## ----------------------------------------------------------------
for(i in 1:3){
  print(paste("i=", i))
}


## ----------------------------------------------------------------
for(i in 1:5){
  if(i %% 2 == 0){
    print('짝수')
  }
  else{
    print('홀수')
  }
}


## ----------------------------------------------------------------
w1<-1:5
ifelse(w1 %% 2 == 0, "짝수", "홀수")


## ----------------------------------------------------------------
x <- list(a = 1:10, beta = exp(-3:3))
(y<-lapply(x, mean))
(z<-sapply(x, mean))
y$a
z[1]


## ----------------------------------------------------------------
(mat <- cbind(x1 = 3, x2 = c(3:1, 2:4)))
rownames(mat)<-letters[1:6]
apply(mat, 1, mean)
apply(mat, 2, mean)


## ----------------------------------------------------------------
tapply(Cars93$Price, Cars93$Type, mean)
#with(Cars93, tapply(Price, Type, mean))


## ----------------------------------------------------------------
aggregate(Price ~ Type, Cars93, mean)


## ----------------------------------------------------------------
## ----------------------------------------------------------------

library(dplyr)

## ----------------------------------------------------------------
exam<-read.csv("DataSet/csv_exam.csv")

exam %>% filter(class == 1)


## ----------------------------------------------------------------
exam %>% filter(class %in% c(1,3))


## ----------------------------------------------------------------
exam %>% filter(math >= 90 | english >= 90)


## ----------------------------------------------------------------
exam %>% filter(class == 2 & english >= 80)
# exam %>% filter(class == 2, english >= 80) 


## ----------------------------------------------------------------
class1<-exam %>% filter(class == 1)
mean(class1$english)


## ----------------------------------------------------------------
df <- data.frame(sex = c("M", "F", NA, "M", "F"),
                 score = c(5, 4, 3, 4, NA))
df

is.na(df)               # 결측치 확인
table(is.na(df))        # 결측치 빈도 출력
table(is.na(df$sex))  # sex 결측치 빈도 출력


## ----------------------------------------------------------------
df[is.na(df$sex), ]

df %>% filter(is.na(sex))


## ----------------------------------------------------------------
df[!is.na(df$sex), ]

df %>% filter(!is.na(sex))


## ----------------------------------------------------------------
df[!is.na(df$sex)&!is.na(df$score), ]

df %>% filter(!is.na(sex)&!is.na(score))


## ----------------------------------------------------------------
na.omit(df)


## ----------------------------------------------------------------
mean(c(1,2,3, NA))
mean(c(1,2,3, NA), na.rm=T)


## ----------------------------------------------------------------
select<- dplyr::select
exam %>% select(class, math, english) %>% head(3)


## ----------------------------------------------------------------
exam %>% select(classroom=class, math, english) %>% head(3)


## ----------------------------------------------------------------
exam %>% rename(classroom=class) %>% head(3)


## ----------------------------------------------------------------
exam %>% select(-math) %>% head(5)


## ----------------------------------------------------------------
exam %>% select(-math, -english) %>% head(5)


## ----------------------------------------------------------------
exam %>% select(-(math:science)) %>% head(5)


## ----------------------------------------------------------------
exam %>% arrange(math)


## ----------------------------------------------------------------
exam %>% arrange(desc(math)) %>% head(10)


## ----------------------------------------------------------------
exam %>% arrange(english, math) %>% head(10)


## ----------------------------------------------------------------
exam %>% top_n(5, math)


## ----------------------------------------------------------------
exam %>% arrange(desc(math)) %>% head(5)


## ----------------------------------------------------------------
exam %>%
  mutate(average = (math + english + science)/3) %>%
  head


## ----------------------------------------------------------------
exam %>%
  mutate(average = (math + english + science)/3) %>%
  arrange(average) %>%
  head


## ----------------------------------------------------------------
head(exam, n=10)

new_exam<-exam %>% mutate(test=ifelse(science >=70, "pass", "fail"))

head(new_exam, n=10)


## ----------------------------------------------------------------
exam %>% summarise(mean_sc = mean(science))


## ----------------------------------------------------------------
exam %>% summarise(mean_math = mean(math),
            sum_math = sum(math),
            median_math = median(math),
            n = n())


## ----------------------------------------------------------------
exam %>% summarise(class=n_distinct(class))
table(exam$class)


## ----------------------------------------------------------------
exam %>% group_by(class) %>%
  summarise(mean_sc = mean(science))


## ----------------------------------------------------------------
exam %>% group_by(class) %>%
  summarise(mean_math = mean(math),
            median_math = median(math),
            n = n())


## ----------------------------------------------------------------
exam %>% sample_n(7)


## ----------------------------------------------------------------
exam %>% sample_frac(0.2)


## ----------------------------------------------------------------
library(nycflights13)


## ----eval=F------------------------------------------------------
## ?flights # 도움말


## ----------------------------------------------------------------
str(flights)


## ----------------------------------------------------------------
flights %>% filter(month == 1, day == 1) %>% head(5)


## ----------------------------------------------------------------
df <- flights %>% filter(month == 1 & day %in% c(3, 4))
nrow(df)

flights %>% filter(month == 1 & day %in% c(3, 4)) %>%  summarize(n=n())


## ----------------------------------------------------------------
arrange(flights, year, month, day) %>% head(5)


## ----------------------------------------------------------------
arrange(flights, desc(dep_delay)) %>% head(5)


## ----------------------------------------------------------------
flights  %>%  select(year, month, day) %>% head(3)

flights %>% select(year:day) %>% head(3)


## ----------------------------------------------------------------
select(flights, -(year:day)) %>% head(3)


## ----------------------------------------------------------------
flights %>%  select(tail_num = tailnum) %>% head(5)


## ----------------------------------------------------------------
flights %>%  rename(tail_num = tailnum) %>% head(5)


## ----------------------------------------------------------------
flights %>% mutate(gain = arr_delay - dep_delay, speed = distance * 60 / air_time) %>%  head(3)


## ----------------------------------------------------------------
f1<-mutate(flights, gain = arr_delay - dep_delay, speed = distance * 60 / air_time)
colnames(f1)


## ----------------------------------------------------------------
flights %>%  summarise(delay = mean(dep_delay, na.rm = TRUE))

#summarise(flights, delay = mean(dep_delay)) # NA


## ----------------------------------------------------------------
flights %>%
  group_by(year, month, day) %>%
  select(arr_delay, dep_delay, year, month, day) %>%
  summarise(arr = mean(arr_delay, na.rm = TRUE), dep = mean(dep_delay, na.rm = TRUE)) %>%
  filter(arr > 50 & dep > 50)


## ----------------------------------------------------------------
name<-data.frame(class = c(1, 2, 3, 4, 5),
                   teacher = c("kim", "lee", "park", "choi", "jung"))
name

exam_new<-left_join(exam, name, by = "class")
head(exam_new, n=10)


## ----------------------------------------------------------------
group_a <- data.frame(id = c(1, 2, 3, 4, 5), test = c(60, 80, 70, 90, 85))

group_b <- data.frame(id = c(5, 7, 8), test = c(65, 80, 90))

group_all <- bind_rows(group_a, group_b)
group_all


## ----------------------------------------------------------------
bind_rows(data.frame(x = 1:3), data.frame(y = 1:4))


## ----------------------------------------------------------------
payroll<-read.csv("DataSet/payroll.csv")
head(payroll, n=7)


## ----------------------------------------------------------------
payroll2<-read.csv("DataSet/payroll2.csv")
head(payroll2, n=7)


## ----------------------------------------------------------------
payroll$BirthD<-as.Date(as.character(payroll$Birth), '%Y/%m/%d')
payroll$BirthD[1:5]
str(payroll)


## ----------------------------------------------------------------
min_b<-payroll %>% group_by(Gender) %>% summarize(BirthD = min(BirthD))
min_b


## ----------------------------------------------------------------
left_join(min_b, payroll, by="BirthD")


## ----------------------------------------------------------------
payroll$Age<-floor((Sys.Date()-payroll$BirthD)/ 365.25)
payroll %>% group_by(Jobcode) %>% summarize(avg_age = round(mean(Age), digits=0), avg_salary = mean(Salary))


## ----------------------------------------------------------------
names(payroll2)[1]<-names(payroll)[1]
updated<-left_join(payroll, payroll2, by="IdNumber")
updated$salary2<-ifelse(is.na(updated$salary), updated$Salary, updated$salary)
updated %>% select(IdNumber, Gender, Jobcode, Salary, salary, salary2) %>% head(15)

>>>>>>> 5c5a7e65ae3a3edf20e3212427f4d26207c4addc
